app/views/users/show.html.erb


<br><% if @user.friends.size ==0%>
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 3]]