app/views/gifts/_friendform.html.erb

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]
---
    Gift for <%=@friend.name%>
    <%= f.collection_check_boxes(:friend_ids, @user.friends.find_all{|p| p!=@friend}, :id, :name) %>