app/views/gifts/_purchased.html.erb

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
        <td><%= gift.name %></td>
        <td><%= Friend.find(gift.friend_id).name %></td>