app/views/gifts/edit.html.erb

<form id="delete-gift" data-user=<%=current_user.id%> action="delete" method="POST"><input type="submit" value="Delete Gift">
<%= render partial: "friendform", locals:{friend: Friend.find(@gift.friend_id), gift: @gift, user: current_user}%>
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]