app/helpers/friends_helper.rb

    def user_friends_table(user)
        if user.friends.size == 0
---
SELECT COUNT(*) FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]