app/helpers/gifts_helper.rb

    def user_gifts_table(user)
        if @friend
            render partial: "gifts/table", locals: {user: @user, friends: user.friends, friend: @friend, gifts: user.gifts}
        else
            if user.gifts.size == 0
                content_tag(:p, "You haven't found any gifts".html_safe)
            else
                user.friends.each do |f|
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT "gifts".* FROM "gifts" INNER JOIN "friend_gifts" ON "gifts"."id" = "friend_gifts"."gift_id" INNER JOIN "friends" ON "friend_gifts"."friend_id" = "friends"."id" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "gifts" INNER JOIN "friend_gifts" ON "gifts"."id" = "friend_gifts"."gift_id" INNER JOIN "friends" ON "friend_gifts"."friend_id" = "friends"."id" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT "gifts".* FROM "gifts" INNER JOIN "friend_gifts" ON "gifts"."id" = "friend_gifts"."gift_id" INNER JOIN "friends" ON "friend_gifts"."friend_id" = "friends"."id" WHERE "friends"."user_id" = ?  [["user_id", 8]]