app/controllers/friends_controller.rb

    def new
        @friend=Friend.new
        @user=User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @friend = Friend.create(friend_params)
---
INSERT INTO "friends" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Amanda"], ["user_id", 1], ["created_at", "2018-11-24 22:05:06.973344"], ["updated_at", "2018-11-24 22:05:06.973344"]]