app/controllers/friends_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        #binding.pry
        user=User.find(params[:user_id])

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @friend = Friend.find(params[:id])

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @friend = Friend.find(params[:id])

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def next
        @friend = Friend.find(params[:id])

INSERT INTO "friends" ("name", "user_id", "created_at", "updated_at", "gift_status", "amount_spent") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mike Pixley"], ["user_id", 1], ["created_at", "2018-11-26 17:35:07.037232"], ["updated_at", "2018-11-26 17:35:07.037232"], ["gift_status", "No Gift"], ["amount_spent", 0]]
UPDATE "friends" SET "updated_at" = ?, "gift_status" = ?, "amount_spent" = ? WHERE "friends"."id" = ?  [["updated_at", "2018-11-26 17:31:35.752073"], ["gift_status", "No Gift"], ["amount_spent", 0], ["id", 1]]
INSERT INTO "friends" ("name", "user_id", "created_at", "updated_at", "gift_status", "amount_spent") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Another Friend"], ["user_id", 1], ["created_at", "2018-11-26 20:20:49.405192"], ["updated_at", "2018-11-26 20:20:49.405192"], ["gift_status", "No Gift"], ["amount_spent", 0]]
---
    def create
        @friend = Friend.create(friend_params)
        @friend.user=current_user
        @friend.gift_status="No Gift"
        @friend.amount_spent=0
        @friend.save

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 6]]
---
    def delete
        @friend = Friend.find(params[:id])
        @friend.delete