app/controllers/gifts_controller.rb

    def new
        @user = User.find(params[:user_id])
        @gift=Gift.new
        if params[:friend_id]
            @friend=Friend.find(params[:friend_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @gift = Gift.create(gift_params)
        @gift.user_id = params[:user_id]
        @gift.friend_id = params[:friend_id]
        @gift.quantity=0
        if @gift.save
            friend=Friend.find(params[:friend_id])
            friend.gifts<<@gift
---
INSERT INTO "gifts" ("user_id", "name", "link", "price", "quantity", "created_at", "updated_at", "friend_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 1], ["name", "Somethin"], ["link", ""], ["price", 250], ["quantity", 0], ["created_at", "2020-09-26 17:10:16.165226"], ["updated_at", "2020-09-26 17:10:16.165226"], ["friend_id", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "gifts" ("user_id", "name", "link", "price", "created_at", "updated_at", "friend_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "present"], ["link", "http://www.google.com"], ["price", 0], ["created_at", "2018-11-27 23:08:14.174838"], ["updated_at", "2018-11-27 23:08:14.174838"], ["friend_id", 1]]
INSERT INTO "friend_gifts" ("friend_id", "gift_id") VALUES ($1, $2) RETURNING "id"  [["friend_id", 1], ["gift_id", 1]]

    def edit
        @gift = Gift.find(params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def index
        @user=User.find(params[:user_id])

        if params[:friend_id]
            @friend=Friend.find(params[:friend_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def show
        @gift = Gift.find(params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @gift = Gift.find(params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @gift = Gift.find(params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def delete
        @gift = Gift.find(params[:id])

        user=User.find(params[:user_id])
        friend=Friend.find(params[:friend_id])
        if @gift.status == "purchased"
            user.amount_spent-=@gift.price
            user.save
            friend.amount_spent-=@gift.price
            friend.gifts.delete(@gift)
            if friend.gifts.length==0
               friend.gift_status="No Gift"
            end
            friend.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "friends" SET "gift_status" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["gift_status", "Gift Purchased"], ["updated_at", "2018-12-04 21:19:47.923783"], ["id", 1]]
UPDATE "gifts" SET "status" = ?, "quantity" = ?, "updated_at" = ? WHERE "gifts"."id" = ?  [["status", "purchased"], ["quantity", 1], ["updated_at", "2018-12-04 21:19:47.916211"], ["id", 1]]

    def buy
        gift=Gift.find(params[:id])
        user=User.find(params[:user_id])
        friend=Friend.find(params[:friend_id])
        #gift updates
        if gift.status != "purchased"
            gift.status = "purchased"
        end
        gift.quantity+=1
        gift.save
        #friend updates
        if friend.gift_status=="No Gift"
            friend.gift_status="Gift Purchased"
        end
        friend.amount_spent+=gift.price
        friend.save
        #user updates
        user.amount_spent+=gift.price
        user.save
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gifts" SET "status" = $1, "quantity" = $2, "updated_at" = $3 WHERE "gifts"."id" = $4  [["status", "purchased"], ["quantity", 1], ["updated_at", "2020-09-26 17:10:18.288555"], ["id", 1]]
UPDATE "friends" SET "gift_status" = $1, "amount_spent" = $2, "updated_at" = $3 WHERE "friends"."id" = $4  [["gift_status", "Gift Purchased"], ["amount_spent", 250], ["updated_at", "2020-09-26 17:10:18.293447"], ["id", 1]]
UPDATE "users" SET "amount_spent" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["amount_spent", 250], ["updated_at", "2020-09-26 17:10:18.299114"], ["id", 1]]