app/controllers/sessions_controller.rb

      def new
        @user = User.new
        @users = User.all
---
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]