app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @friends=@user.friends.select{|f| f.gift_status= "No Gift"}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT "gifts".* FROM "gifts" INNER JOIN "friends" ON "gifts"."friend_id" = "friends"."id" WHERE "friends"."user_id" = ?  [["user_id", 1]]

    def create
        @user = User.create(user_params)
        @user.amount_spent=0
        @user.save
---
INSERT INTO "users" ("name", "budget", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "amount_spent" = ? WHERE "users"."id" = ?  [["updated_at", "2018-12-04 22:20:35.879521"], ["amount_spent", 0], ["id", 8]]